//Да се състави програма, която въвежда от клавиатурата стойностите на две променливи а и b.
//Програмата да извежда разликата a-b. Да разменя стойностите на двете променливи и отново 
//да извежда същата разлика.

#include<iostream>
using namespace std;
int main()
{
    int a, b; //променливите а и b
    cout << "Enter a: ";
    cin >> a; //въвеждаме а
    cout << "Enter b: ";
    cin >> b; //въвеждаме b
    int x = a - b; 
    cout << "a - b = " << x << endl;
    int m; //променлива за размяната на a и b
    m = a; //m запазва стойността на а
    a = b; //а взима стойността на b
    b = m; //b взима стойността на m, която всъщност е първоначалната стойност на a
    int y = a - b;
    cout << "a - b = " << y << endl;
    return 0;
}