/*Да се състави програма, която въвежда от клавиатурата цяло петцифрено число n. 
Програмата да намира и извежда броя на цифрите на числото n, които са четни.*/

#include <iostream>
using namespace std;
int main()
{
    int n, x;
    int count = 0; //брояч за четните числа
    cout << "Enter n: ";
    cin >> n; //въвеждаме числото n от клавиатурата

    //правим проверка дали числото е 5-цифрено
    if (n > 10000 && n < 99999)
    {
        while (n != 0)
        {
            x = n % 10;
            if (x % 2 == 0)
            {
                count++; //ако дадена цифра от числото n е четна, увеличаваме брояча с единица
            }
            n = n / 10;
        }
        cout << count << endl; //извеждаме на екран броя на четните цифри в числото n
    }
    else
    {
        cout << "Enter a 5-digit number!" << endl; //ако числото n не е 5-цифрено, извеждаме подходящо съобщение
    }

    return 0;
}