/*Да се напише програма, която декларира и въвежда масив от символи, 
след което извежда колко пъти символът 'a' се среща в масива.*/

#include <iostream>
using namespace std;
int main()
{
    char arr[100]; //деклариране на низ с максимална дължина 99 символа
    char searching = 'a'; //търсеният елемент в низа
    int counter = 0; //брояч с начална стойност 0

    cout << "Enter your string: ";
    cin >> arr; //въвеждаме низ от клавиатурата

    for (int i = 0; i < 100; i++)
        if (arr[i] == searching) counter++; //проверяваме дали търсеният елемент се среща в низа и ако да, увеличаваме брояча с 1
    cout << "'a' symbol was founded " << counter << " times." << endl; //извеждаме на екран колко пъти се среща търсената стойност
    return 0;
}
