/*Да се напише програма, която въвежда от клавиатурата низ, представляващ
изречение с дължина не повече от 80 символа, завършващо с точка. Всяка дума
е разделена от останалите с един интервал. Да се изведе броят на думите в изречението.*/

#include<iostream>
using namespace std;
int main()
{
    char str[80];
    int counter = 1; //брояч, равен на 1, защото преди първия интервал има 1 дума
    int i = 0;

    cout << "Enter your sentence: ";
    cin.getline(str,80);

    while(str[i] != '\0')
    {
        if(str[i] == ' ') counter++; //ако има интервал, то след него има дума и увеличавеаме брояча с 1

        if(str[i]== '.') break; //ако имаме точка, изпълнението на програмата трябва да прекъсне, защото това е край на изречението

        i++;
    }
    cout << "The number of words is: " << counter << endl;
    return 0;
}
