/*Да се напише програма, която въвежда от клавиатурата низ, представляващ 
изречение с дължина не повече от 80 символа, завършващо с точка. Всяка дума
е разделена от останалите с един интервал. Да се изведе броят на еднобуквените
думи в изречението.*/

#include<iostream>
using namespace std;
int main()
{
    char str[80];
    int counter = 0; //брояч
    int i = 0;

    cout << "Enter your sentence: ";
    cin.getline(str,80);

    //правим проверка дали първата дума в изречението е съставена само от една буква, т.е.
    //предполага се, че след като е първа няма интервал преди нея
    if(str[0] != 0 && str[1] == ' ') counter++;

    int a = strlen(str) - 3; //намираме елемента на трета позиция от края на низа
    int b = strlen(str) - 2; //намираме елемента на втора позиция от края на низа

    if(str[a] == ' ' && str[b] != ' ') counter++; //проверяваме за дължината на последната дума преди точката
    

     while(str[i] != '\0')
    {
        if(str[i]== '.') break; //ако имаме точка, изпълнението на програмата трябва да прекъсне, защото това е край на изречението

        //проверяваме дали думите в средата на изречението се състоят от една буква
        if(str[i] != ' ' && str[i - 1] == ' ' && str[i + 1] == ' ') counter++; 
        i++;
    }
    cout << "The number of words with one letter is: " << counter << endl;
    return 0;
}
