/*Да се напише програма, която въвежда низ на един ред, съдържащ 
трите имена на човек, разделени с по един интервал. Да се изведат трите имена на 
отделен ред.*/

#include <iostream>
#include <cctype>
using namespace std;
int main()
{
    char str[50]; //деклариране на низ с максимална дължина 20 символа

    cout << "Enter your string: ";
    
    //!!!
    //Когато се въвежда низ от клавиатурата посредством cin>>, не може да се въвеждат интервали, табулации
    //и знаци за нов ред, защото те прекратяват въвеждането. Ако се налага да се въвеждат такива символи, 
    //се използва функцията getline(). 

    cin.getline(str, 50); //въвеждаме низ от клавиатурата

    int i = 0;
    while(str[i] != '\0')
    {
        if(str[i] == ' ')
        {
         cout << '\n';
         str[i] = '\0';
        }
        cout << str[i];
        i++;
    }
    cout << endl;
    return 0;
}
